{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_7": {"name": "keras_tensor_7:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "7"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_7", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "30"}, {"size": "7"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1_1/lstm_2_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/transpose", "op": "Transpose", "input": ["keras_tensor_7", "StatefulPartitionedCall/functional_1_1/lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/Shape", "op": "Shape", "input": ["keras_tensor_7"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/transpose", "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/Shape", "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice/stack", "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice", "StatefulPartitionedCall/functional_1_1/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/strided_slice", "StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/zeros/packed", "StatefulPartitionedCall/functional_1_1/lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1/packed", "StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1_1/lstm_1/zeros", "^StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/Max", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_counter", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/zeros", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/time", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_27", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvZnVuY3Rpb25hbF8xXzEvbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_21", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_24", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_19", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_18", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_53"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_22", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_23", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_20", "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/input_control_node/_148", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_25", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_26", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_27", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_29", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_30", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_31", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_32", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_33", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_34", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_29", "StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_30", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/input_control_node/_148"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/input_control_node/_148"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_31", "StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/Less_1", "StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/Less"]}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36", "op": "LoopCond", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/cond/_16/functional_1_1/lstm_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/Max_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_30", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_counter_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_29", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_34", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_35", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/time_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_31", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_33", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/merge/_32", "StatefulPartitionedCall/functional_1_1/lstm_1/while/LoopCond/_36"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/Max_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_counter_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_body_control/_44", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_counter_switch/_37:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1_switch/_42"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_43"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/time_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_switch/_41"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/Max_switch/_38", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_43", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2_1_switch/_40", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/time_switch/_39", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_body_control/_44", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1_switch/_42", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_switch/_41", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_25", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_26", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/exit/_48", "StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "30"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input/_163", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/time_switch/_39:1", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_25", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_26", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/enter/_27", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/functional_1_1/lstm_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/while/loop_counter_switch/_37:1", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input/_163", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_43:1", "Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input/_163", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_switch/_41:1", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/output_control_node/_181", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_59", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_43:1", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/output_control_node/_181", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/Max_switch/_38:1", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/output_control_node/_181", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/NoOp", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/input_control_node/_160"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add_1", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/output_control_node/_181", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/add", "^Func/StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/output_control_node/_181", "^StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1_2/Shape", "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice/stack", "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice/stack_1", "StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice", "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1_2/strided_slice", "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros/packed", "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1/packed", "StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1_2/while/LoopControlInputs/_72", "op": "NoOp", "input": ["^StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/functional_1_1/lstm_1_2/TensorArrayV2_1", "^StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros", "^StatefulPartitionedCall/functional_1_1/lstm_1_2/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/functional_1_1/lstm_1/while/StatefulPartitionedCall/functional_1_1/lstm_1/zeros_1_switch/_42:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/lstm_1/while/body/_17/functional_1_1/lstm_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": 